## Imports

In [1]:
import pandas as pd
import numpy as np
import os

## Arquivos na pasta Datasets

In [21]:
base = './../../Datasets/'
arquivos = [arquivo for arquivo in os.listdir(base)]

arquivos

['populacao_brasileira.csv',
 'german_credit_data.csv',
 'dataset_valores.txt',
 'diamonds.csv',
 'NAs.txt',
 '2010SitkaAK.csv',
 '2018WinterOlympics.csv',
 'Exercicio_Pandas_3.csv',
 'Iris.csv',
 'dataset_array.txt',
 '2010YumaAZ.csv',
 'bmw_pricing_challenge.csv',
 'heart.csv',
 'Exercicio_Pandas_2.json',
 'BankChurners.csv',
 '2010SantaBarbaraCA.csv',
 'dataset_valores_vazio.txt',
 'Exercicio_Pandas_1.csv',
 'dataset_desconfigurado.txt',
 'kc_house_data.csv',
 'cars.csv']

## Lendo datasets população do Brasil (time series)

In [3]:
populacao = pd.read_csv(f'{base}/{arquivos[0]}', sep=';')
display(populacao.shape, populacao.head())

(37, 2)

   year  population
0  1980   119011052
1  1981   121154159
2  1982   123774229
3  1983   126403352
4  1984   129025577

## Lendo dados de crédito

In [4]:
credit = pd.read_csv(f'{base}/{arquivos[1]}')
display(arquivos[1], credit.shape, credit.head())

'german_credit_data.csv'

(1000, 10)

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education
3,3,45,male,2,free,little,little,7882,42,furniture/equipment
4,4,53,male,2,free,little,little,4870,24,car

## Leitura de valores a partir de arquivo TXT

In [5]:
valores = pd.read_fwf(f'{base}/{arquivos[2]}', widths=[8, 8, 8])
valores.columns = ['A', 'B', 'C']

display(arquivos[2], valores.shape, valores.head())

'dataset_valores.txt'

(5, 3)

        A       B       C
0  0.4839  0.4536  0.3561
1  0.1292  0.6875  0.6565
2  0.1781  0.3049  0.8928
3  0.7676  0.5801  0.2038
4  0.5993  0.4357  0.7410

## Leitura a partir de txt
* leitura de colunas separadas por tabs

In [6]:
# NAs
nas = pd.read_csv(f'{base}/{arquivos[4]}', sep='\t')
nas = nas.iloc[:,1:]
display(arquivos[4], nas.shape, nas.head())

'NAs.txt'

(10, 3)

          A         B         C
0 -0.166919  0.979728 -0.632955
1 -0.297953 -0.912674 -1.365463
2 -0.120211 -0.540679 -0.680481
3       NaN -2.027325  1.533582
4       NaN       NaN  0.461821

In [7]:
# Arquivos que começam com 2010 e são iguais
for arquivo in arquivos:
    if arquivo.startswith('2010'):
        df = pd.read_csv(f'{base}/{arquivo}')
        display(arquivo, df.shape, df.head())

'2010SitkaAK.csv'

(168, 4)

   LST_DATE      DAY LST_TIME  T_HR_AVG
0  20100601  TUESDAY     0:00      10.5
1  20100601  TUESDAY     1:00      10.5
2  20100601  TUESDAY     2:00      10.0
3  20100601  TUESDAY     3:00       9.7
4  20100601  TUESDAY     4:00       9.4

'2010YumaAZ.csv'

(168, 4)

   LST_DATE      DAY LST_TIME  T_HR_AVG
0  20100601  TUESDAY     0:00      25.2
1  20100601  TUESDAY     1:00      24.1
2  20100601  TUESDAY     2:00      24.4
3  20100601  TUESDAY     3:00      24.9
4  20100601  TUESDAY     4:00      22.8

'2010SantaBarbaraCA.csv'

(168, 4)

   LST_DATE      DAY LST_TIME  T_HR_AVG
0  20100601  TUESDAY     0:00      12.7
1  20100601  TUESDAY     1:00      12.7
2  20100601  TUESDAY     2:00      12.3
3  20100601  TUESDAY     3:00      12.5
4  20100601  TUESDAY     4:00      12.7

In [8]:
# Olympics
olympics = pd.read_csv(f'{base}/{arquivos[6]}')
display(arquivos[6], olympics.shape, olympics.head())

'2018WinterOlympics.csv'

(30, 6)

   Rank            NOC  Gold  Silver  Bronze  Total
0     1         Norway    14      14      11     39
1     2        Germany    14      10       7     31
2     3         Canada    11       8      10     29
3     4  United States     9       8       6     23
4     5    Netherlands     8       6       6     20

In [9]:
produtos_01 = pd.read_csv(f'{base}/{arquivos[7]}', sep='\t')
display(arquivo, produtos_01.shape, produtos_01.head())

'cars.csv'

(2, 4)

   Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
0    Mouse                  60              50         3000
1  Teclado                  40             100         4000

In [10]:
iris = pd.read_csv(f'{base}/{arquivos[8]}')
display(arquivos[8], iris.shape, iris.head())

'Iris.csv'

(150, 6)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [11]:
data = pd.read_csv(f'{base}/{arquivos[9]}', header=None)
display(arquivos[9], data.shape, data.head(), data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       6 non-null      float64
dtypes: float64(1)
memory usage: 176.0 bytes

'dataset_array.txt'

(6, 1)

     0
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0

None

In [12]:
bmw_pricing_challenge = pd.read_csv(f'{base}/{arquivos[11]}')
display(arquivos[11], bmw_pricing_challenge.shape, bmw_pricing_challenge.head())

'bmw_pricing_challenge.csv'

(4843, 18)

,maker_key,model_key,mileage,engine_power,registration_date,fuel,paint_color,car_type,feature_1,feature_2,feature_3,feature_4,feature_5,feature_6,feature_7,feature_8,price,sold_at
0,BMW,118,140411,100,2012-02-01,diesel,black,convertible,True,True,False,False,True,True,True,False,11300,2018-01-01
1,BMW,M4,13929,317,2016-04-01,petrol,grey,convertible,True,True,False,False,False,True,True,True,69700,2018-02-01
2,BMW,320,183297,120,2012-04-01,diesel,white,convertible,False,False,False,False,True,False,True,False,10200,2018-02-01
3,BMW,420,128035,135,2014-07-01,diesel,red,convertible,True,True,False,False,True,True,True,True,25100,2018-02-01
4,BMW,425,97097,160,2014-12-01,diesel,silver,convertible,True,True,False,False,False,True,True,True,33400,2018-04-01

In [13]:
heart = pd.read_csv(f'{base}/{arquivos[12]}')
display(arquivos[12], heart.shape, heart.head())

'heart.csv'

(303, 14)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [14]:
produtos_02 = pd.read_json(f'{base}/{arquivos[13]}')
display(arquivos[13], produtos_02.shape, produtos_02.head())

'Exercicio_Pandas_2.json'

(5, 4)

     Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
0    Celular                 100            1000       100000
1         TV                  50            2000       100000
2   Notebook                  70            2500       175000
3     Tablet                  30             800        24000
4  Headphone                  80             150        12000

In [15]:
bc = pd.read_csv(f'{base}/{arquivos[14]}')
display(arquivos[14], bc.shape, bc.head())

'BankChurners.csv'

(10127, 23)

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,...,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_1,Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_2
0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,...,12691.0,777,11914.0,1.335,1144,42,1.625,0.061,0.000093,0.99991
1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,...,8256.0,864,7392.0,1.541,1291,33,3.714,0.105,0.000057,0.99994
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,...,3418.0,0,3418.0,2.594,1887,20,2.333,0.000,0.000021,0.99998
3,769911858,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,34,...,3313.0,2517,796.0,1.405,1171,20,2.333,0.760,0.000134,0.99987
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,...,4716.0,0,4716.0,2.175,816,28,2.500,0.000,0.000022,0.99998

In [16]:
headers = ['A','B','C']
# sizes = [len(h) for h in headers] # Não funcionou pq os cabeçalhos possuem diferente extensão que as colunas (dados)
sizes = np.full((1,3), 8).tolist()[0]

valores = pd.read_fwf(f'{base}/{arquivos[16]}', widths=sizes, skiprows=1, names=headers)
display(arquivos[16], sizes, valores.shape, valores.head())

'dataset_valores_vazio.txt'

[8, 8, 8]

(6, 3)

          A       B       C
0  A  \t  B       C     NaN
1    0.4839  0.4536  0.3561
2    0.1292  0.6875   Vazio
3    0.1781  0.3049  0.8928
4     Vazio  0.5801  0.2038

In [17]:
headers = ['SITUACAO', 'LOTE', 'DATA', 'NUMERO']
sizes = [12, 2, 15, 10]
desconf = pd.read_fwf(f'{base}/{arquivos[18]}', widths=sizes, names=headers, skiprows=2)
display(arquivos[18], desconf.shape, desconf.head())

'dataset_desconfigurado.txt'

(20, 4)

   SITUACAO  LOTE    DATA      NUMERO
0         1     1  202306  5223103928
1         0     2  202306  5223101250
2         0     3  202306  5223101961
3         0     3  202306  5223109972
4         0     5  202306  5223139983

In [19]:
house = pd.read_csv(f'{base}/{arquivos[19]}')
display(arquivos[19], house.shape, house.head())

'kc_house_data.csv'

(21613, 21)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3.0,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3.0,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2.0,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4.0,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3.0,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503